homeworks/hw2/rottenpotatoes/app/controllers/movies_controller.rb

    lista.each { |l| session[:ratings][l]='1'}
    # filter by params
    if params[:sort_title]
      @movies = Movie.where(@@WHERE_FILTER_RATING,lista).order("title  #{params[:sort_title].to_s} ")
      flash[:title]='hilite'
      flash[:release_date]=''
    elsif params[:sort_release_date]
      @movies = Movie.where(@@WHERE_FILTER_RATING,lista).order("release_date #{params[:sort_release_date].to_s}")
      flash[:release_date]='hilite'
      flash[:title]=''
    else
      @movies = Movie.where(@@WHERE_FILTER_RATING,lista)
---
SELECT "movies".* FROM "movies" WHERE (rating in (NULL)) ORDER BY title asc
SELECT "movies".* FROM "movies" WHERE (rating in (NULL)) ORDER BY release_date asc
SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','R'))